* Followup notes
1. Check your homework grades

2. Total energies between functionals do not mean anything useful


** 3. Generating bibtex files
Do not type in entries except as a last resort! Tedious, error-prone, tedious...

*** M-x doi-add-bibtex-entry
Enter doi at prompt, then the bibtex file, press enter

10.1063/1.1809574

To insert a citation: C-c ]
cite:olsen-2004-compar-method

subtle points: If you highlight a doi and run the command it is inserted for you
If you just copied a doi to the clipboard and run the command, it is inserted for you

*** M-x crossref-add-bibtex-entry

Gamarra, D.; Munuera, G.; Hungria, A. B.; Fernandez-Garcia, M.; Conesa, J. C.; Midgley, P. A.; Wang, X. Q.; Hanson, J. C.; Rodriguez, J. A.; Martinez-Arias, A. J. Phys. Chem. C 2007, 111, 11026−11038.

** Inserting citations
Do not type cite links in by hand. Tedious, error-prone, tedious...

First, add a link to the bibliography file, e.g.


Type: C-c ] to select entries. choose entry, press enter. cite:sokalski-2012-optim-ta

cite:sokalski-2012-optim-ta,gao-2015-surfac

cite:olsen-2004-compar,gao-2015-surfac,sokalski-2012-optim-ta

C-spc to select more than one entry, then enter to add them all at once.

** ase.io.write
pydoc:ase.io.write


#+BEGIN_SRC python
from ase.structure import molecule

atoms = molecule('C2H2')
print atoms

from ase.io import write
write('geom.xyz', atoms)
#+END_SRC

#+RESULTS:
: Atoms(symbols='C2H2', positions=..., cell=[1.0, 1.0, 1.0], pbc=[False, False, False])


#+BEGIN_SRC sh
cat geom.xyz
#+END_SRC

#+RESULTS:
: 4
: Lattice="1.0 0.0 0.0 0.0 1.0 0.0 0.0 0.0 1.0" Properties=species:S:1:pos:R:3 pbc="F F F"
: C      0.00000000       0.00000000       0.60808000
: C      0.00000000       0.00000000      -0.60808000
: H      0.00000000       0.00000000      -1.67399000
: H      0.00000000       0.00000000       1.67399000

** References

bibliographystyle:unsrtnat
bibliography:references.bib

* [[../dft-book/dft.org::*Molecular reaction barriers]]
Nudged elastic band discussions


#+BEGIN_SRC python
import jasp
print jasp.__file__
#+END_SRC

#+RESULTS:
: /opt/kitchingroup/vasp-5.3.5/jasp-s16/jasp/__init__.pyc

